# Перегруппировка.

# Напишите программу, которая принимает строку из нескольких слов, разделенных запятыми, от пользователя.
# Программа должна:
# Разделить строку на список слов с использованием метода split().
# Объединить этот список слов в одну строку с использованием метода join(), разделив слова пробелами.
# Вывести результаты каждой операции.

text = input('Provide a text separated by comas: ')
split_text = text.split(',')
joined_text = ' '.join(split_text)
print(split_text)
print(joined_text)
